--[[*****************************Copyright(c)**********************************
**				Guangzhou DACAIGAUNGDIAN Technology Co. Ltd
**
**							 http://www.gz-dc.com
**
**------File Info-----------------------------------------------------------
** File Name:			    main.lua
** Latest modified Date:	2019/2/22
** Latest Version:			
** Description:				显示文字
**
**--------------------------------------------------------------------------
** Created By:				林青田
** Created date:			2019/2/22
** Version:					V1.0	
** Descriptions:			显示文字
**
**--------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
***************************************************************************--]]

--[[***************************************************************************
** Function name:  on_control_notify
** Descriptions:   用户通过触摸修改控件后，执行此回调函数。
				   点击按钮控件，修改文本控件、修改滑动条都会触发此事件。
				   注意：回调函数的参数和函数名固定不能修改
** Input value :   screen  画面ID
				   control 控件ID
				   value   控件值(包括文本控件输入的值)
***************************************************************************--]]
function on_control_notify(screen,control,value)
	if screen == 0 and control == 1 and value == 1 then
        set_text(0,2,"HELLO LUA")
	end
end

--[[************************************************************************
END FILE
************************************************************************--]]

