--[[*****************************Copyright(c)**********************************
**				Guangzhou DACAIGAUNGDIAN Technology Co. Ltd
**
**							 http://www.gz-dc.com
**
**------File Info-----------------------------------------------------------
** File Name:			    main.lua
** Latest modified Date:	2019/1/18
** Latest Version:			
** Description:				常用的回调函数的使用说明
**
**--------------------------------------------------------------------------
** Created By:				林青田
** Created date:			2019/1/24
** Version:					V1.0	
** Descriptions:			常用回调函数的使用说明
**
**--------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
***************************************************************************--]]

local test_value = 0 

--[[***************************************************************************
** Function name:  on_init
** Descriptions:   系统初始化时，执行此回调函数。
				   注意：回调函数的参数和函数名固定不能修改
***************************************************************************--]]
function on_init()

end


--[[***************************************************************************
** Function name:  on_systick
** Descriptions:   定时回调函数，系统每隔1秒钟自动调用。
				   注意：回调函数的参数和函数名固定不能修改
***************************************************************************--]]
function on_systick()

end


--[[***************************************************************************
** Function name:  on_timer
** Descriptions:   定时器超时，执行此回调函数
				   注意：回调函数的参数和函数名固定不能修改
** Input value :   timer_id 定时超时的定时器ID号，定时器编号0~31
***************************************************************************--]]
function on_timer(timer_id)

end


--[[***************************************************************************
** Function name:  on_control_notify
** Descriptions:   用户通过触摸修改控件后，执行此回调函数。
				   点击按钮控件，修改文本控件、修改滑动条都会触发此事件。
				   注意：回调函数的参数和函数名固定不能修改
** Input value :   screen  画面ID
				   control 控件ID
				   value   控件值(包括文本控件输入的值)
***************************************************************************--]]
function on_control_notify(screen,control,value)
	--******************************************************
	--功能：按钮控件画面读写按钮控件值
	--调用函数：set_value(screen,control,value)  
	--调用函数：get_value(screen,control)
    --Input value :   screen  画面ID
	--			      control 控件ID
	--			      value   控件值
	--******************************************************
	if screen == 1 then
	    if control == 13 and value == 1 then                       --按下按钮显示运算结果
		    local A = get_value(1,1)
		    local B = get_value(1,2)
		    set_value(1,3,A+B)                                     --显示A+B的结果
		    set_value(1,4,A-B)									   --显示A-B的结果
			set_value(1,5,A*B)									   --显示A*B的结果
			set_value(1,6,A/B)									   --显示A/B的结果
			if A < B  then										   --显示A与B的比较
				set_value(1,7,1)
			else
			    set_value(1,7,0)
            end
			if A > B  then										 
				set_value(1,8,1)
			else 
			    set_value(1,8,0)                                   
			end
			if A <= B  then									                                          
				set_value(1,9,1)
			else 
			    set_value(1,9,0)
			end
			if A >= B  then
				set_value(1,10,1)
			else 
			    set_value(1,10,0)
			end
			if A == B  then
				set_value(1,11,1)
			else 
			    set_value(1,11,0)
			end
			if A ~= B  then
				set_value(1,12,1)
			else 
			    set_value(1,12,0)
			end
		end
	end 
	--******************************************************
	--功能：文本控件画面读写控件件值
	--调用函数：set_value(screen,control,value)
	--          set_text(screen,control,value)
	--          get_value(screen,control)
	--          get_text (screen,control)
    --Input value :   screen  画面ID
	--			      control 控件ID
	--			      value   控件值(包括文本控件输入的值)
	--*******************************************************
	if screen == 2 then
	    if control == 12 and value == 1 then                       --按下按钮12，运行函数
		    local value = 0
			local value2 = 0
		--********************************************************
		--功能：开方
		--调用函数：math.sqrt(num)
		--参数 :    num  数值
		--*********************************************************
			value = math.sqrt(16)
			set_value(2,2,value)
		--********************************************************
		--功能：取模运算（类求x/y余）
		--调用函数：math.fmod(x，y)
		--参数 :    x  数值
		--参数 :    y  数值
		--*********************************************************			
			value = math.fmod(14,5)
			set_value(2,3,value)
		--********************************************************
		--功能：取绝对值
		--调用函数：math.abs(x)
		--参数 :    x  数值
		--*********************************************************				
			value = math.abs(-16)
			set_value(2,4,value)
		--********************************************************
		--功能：获取数值的整数部分及小数部分
		--调用函数：math.modf(x)
		--参数 :    x  数值
		--*********************************************************				
			value,value2 = math.modf(15.98)
			set_value(2,5,value)
			set_value(2,13,value2)
		--********************************************************
		--功能：余弦函数	
		--调用函数：math.cos(x)
		--参数 :    x              弧度
		--*********************************************************				
			value = math.cos(0.5)
			set_value(2,6,value)
		--********************************************************
		--功能：正弦函数	
		--调用函数：math.sin(x)
		--          math.rad(30)   角度转换弧度
		--参数 :    30             角度
		--*********************************************************					
			value = math.sin(math.rad(30))
			set_value(2,7,value)
		--********************************************************
		--功能：正切函数	
		--调用函数：math.tan(x)
		--参数 :    x  弧度
		--*********************************************************				
			value = math.tan(0.5) 
			set_value(2,8,value)
		--********************************************************
		--功能：筛选出输入的参数中最大的参数
		--调用函数：math.max(arg...)
		--参数 :    arg  数值（可多个参数，参数数量不定）
		--*********************************************************	
			value = math.max(2.71,100,-98,23)
			set_value(2,9,value)
		--********************************************************
		--功能：筛选出输入的参数中最小的参数
		--调用函数：math.min(arg...)
		--参数 :    arg  数值（可多个参数，参数数量不定）
		--*********************************************************		
			value = math.min(2.71,100,-98,23)
			set_value(2,10,value)
			
		end
	end 
	--********************************************************
	--功能：简单的字符串处理
	--调用函数：set_value(screen,control,value)
	--调用函数：get_value(screen,control)
    --参数 :    screen  画面ID
	--			control 控件ID
	--	        value   控件值
	--*********************************************************
	if screen == 3 then
	    if control == 12 and value == 1 then
			local str_value = 0
			local str_value2 = 0
			str_value2  = get_text(3,2)
			str_value = get_value(3,1)
			set_text(3,3,str_value..str_value2)                         --字符串拼接
	--********************************************************
	--功能：尝试将参数e转换为数字，当不能转换时返回nil 
	--调用函数：tonumber (e [, base]) 
    --参数 :    e  字符串
	--          [，base]（可选参数，不填时默认转十进制数值，填16转十六进制进制数）
	--*********************************************************
	        if tonumber(str_value2) == nil then                        --字符串转数值
				set_value(3,4,0)   
			else
			     set_value(3,4,tonumber(str_value2))              
			end
	--********************************************************
	--功能：尝试将参数e转换为字符串，当不能转换时返回nil 
	--调用函数：tonumber (e) 
    --参数 :    e  数值
	--*********************************************************			
			set_text(3,5,tostring(str_value))                          --数值转字符串
	--********************************************************
	--功能：在文本框中显示获取字符串长度 
	--调用函数：tonumber (str) 
    --参数 :    str    字符串
	--*********************************************************				
			set_value(3,6,string.len(str_value2))					   --string.len获取字符串的长度
	--********************************************************
	--功能：在文本框中显示截取字的符串str_value的第一个字符
	--调用函数：string.sub(str,i,j)
    --参数 :    str  字符串
	--          i     起始索引
	--          j     截止索引
	--*********************************************************				
			set_text(3,7,string.sub(str_value2,1,2))                  --string.sub获取字符串的长度
		end
	end 
	--********************************************************
	--功能：达到最大值后弹出提示框。提示已到达最大值
	--*********************************************************
	if screen == 4 then
	--********************************************************
	--功能：按一下按钮计数值减一
	--*********************************************************		
	    if control == 2 and value == 1 then
            test_value = test_value - 1 
			if test_value < 0 then
				test_value = 0 
			end
			set_value(4,3,test_value)
			
		end
	--********************************************************
	--功能：按一下按钮计数值加一
	--*********************************************************		
		if control == 4 and value == 1 then
			test_value = test_value + 1 
			if test_value > 10 then
				change_screen(5)
				test_value = 10
			end
			set_value(4,3,test_value)
		end
	end 


end


--[[***************************************************************************
** Function name:  on_screen_change
** Descriptions:   当画面切换至目标画面ID时，执行此回调函数
				   注意：回调函数的参数和函数名固定不能修改
** Input value :   screen  目标画面ID
*******************************************************************************--]]
function on_screen_change(screen)

end
--[[************************************************************************
END FILE
************************************************************************--]]